# Custom YOLOv8 with dual backbone for RGB and IR
nc: 1 # Liczba klas (zmienione na 1 dla 'person')
depth_multiple: 0.67
width_multiple: 0.75

# Backbone dla RGB (3 kanały wejściowe)
backbone_rgb:
  - [-1, 1, Conv, [64, 3, 2, None, 1, 3]] # 0: [in=3, out=64, kernel=3x3, stride=2]
  - [-1, 1, Conv, [128, 3, 2]] # 1: [in=64, out=128]
  - [-1, 3, C2f, [128, 128, 3, True, 1, 0.5]]
  - [-1, 1, Conv, [256, 3, 2]] # 3
  - [-1, 3, C2f, [256, 256, 3, True, 1, 0.5]]
  - [-1, 1, Conv, [512, 3, 2]] # 5
  - [-1, 3, C2f, [512, 512, 3, True, 1, 0.5]]
  - [-1, 1, Conv, [512, 3, 2]] # 7
  - [-1, 3, C2f, [512, 512, 3, True, 1, 0.5]]
  - [-1, 1, SPPF, [512, 5]] # 9 (Output RGB)

# Backbone dla IR (1 kanał wejściowy)
backbone_ir:
  - [-1, 1, Conv, [64, 3, 2, None, 1, 1]] # 10: [in=1, out=64, kernel=3x3, stride=2]
  - [-1, 1, Conv, [128, 3, 2]] # 11: [in=64, out=128]
  - [-1, 3, C2f, [128, 128, 3, True, 1, 0.5]]
  - [-1, 1, Conv, [256, 3, 2]] # 13
  - [-1, 3, C2f, [256, 256, 3, True, 1, 0.5]]
  - [-1, 1, Conv, [512, 3, 2]] # 15
  - [-1, 3, C2f, [512, 512, 3, True, 1, 0.5]]
  - [-1, 1, Conv, [512, 3, 2]] # 17
  - [-1, 3, C2f, [512, 512, 3, True, 1, 0.5]]
  - [-1, 1, SPPF, [512, 5]] # 19 (Output IR)

# Neck
neck:
  - [-1, 1, Conv, [1024, 1, 1]] # 10: Adjust for 512+512 channels after concat
  - [-1, 1, Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12
  - [-1, 3, C2f, [512, 512, 3, True, 1, 0.5]] # 13
  - [-1, 1, Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15
  - [-1, 3, C2f, [256, 256, 3, True, 1, 0.5]] # 16
  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # 18
  - [-1, 3, C2f, [512, 512, 3, True, 1, 0.5]] # 19
  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 10], 1, Concat, [1]] # 21
  - [-1, 3, C2f, [512, 512, 3, True, 1, 0.5]] # 22

# Head
head:
  - [-1, 1, Conv, [512, 3, 1]] # 23
  - [-1, 1, Conv, [5, 1, 1]] # 24: nc (1) + 4 (bbox) = 5
  - [16, 1, Conv, [256, 3, 1]] # 25
  - [-1, 1, Conv, [5, 1, 1]] # 26: nc (1) + 4 (bbox) = 5
  - [19, 1, Conv, [512, 3, 1]] # 27
  - [-1, 1, Conv, [5, 1, 1]] # 28: nc (1) + 4 (bbox) = 5
  - [[24, 26, 28], 1, Detect, [5, 5, 5]] # 29: Detection head (kanały dla warstw 24, 26, 28)
